## Инициализация БД

[Инструкция](https://towardsdatascience.com/heres-how-to-run-sql-in-jupyter-notebooks-f26eb90f3259)

[Пример](https://github.com/IsFilimonov/LearningPath/blob/main/2021/Stepik_Interactive-SQL-Simulator/Chapter_1a.ipynb)

In [1]:
%load_ext sql
import sqlalchemy
engine = sqlalchemy.create_engine('mysql://user:pass@localhost:3306/')
%sql mysql://user:pass@localhost:3306/

'Connected: user@'

In [2]:
%%sql
SELECT version();

 * mysql://user:***@localhost:3306/
1 rows affected.

[('8.0.27',)]

## Создание базы данных

In [3]:
%%sql

CREATE DATABASE IF NOT EXISTS stepik;

 * mysql://user:***@localhost:3306/
1 rows affected.

[]

In [6]:
%%sql
SHOW DATABASES;

   mysql://user:***@localhost:3306/
 * mysql://user:***@localhost:3306/stepik
7 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('stepik',),
 ('sys',),
 ('world',)]

In [5]:
sqlalchemy.create_engine('mysql://user:pass@localhost:3306/stepik')
%sql mysql://user:pass@localhost:3306/stepik

'Connected: user@stepik'

## Создание таблицы

In [27]:
%%sql

CREATE TABLE IF NOT EXISTS book (
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title   VARCHAR(50),
    author  VARCHAR(30),
    price   DECIMAL(8, 2), #
    amount  INT
);

# DECIMAL(8, 2) 
# Десятичное число с 8 цифрами с обеих сторон от запятой и 2 цифрами после неё

   mysql://user:***@localhost:3306/
 * mysql://user:***@localhost:3306/stepik
0 rows affected.
0 rows affected.

[]

In [36]:
%%sql

CREATE TABLE IF NOT EXISTS genre(
    genre_id   INT PRIMARY KEY AUTO_INCREMENT, 
    name_genre VARCHAR(30)
);

   mysql://user:***@localhost:3306/
 * mysql://user:***@localhost:3306/stepik
0 rows affected.

[]

## Вставка записи в таблицу

In [28]:
%%sql
INSERT book (title, author, price, amount)
VALUES ('TEST2', 'authDr', 143.535, 4);

   mysql://user:***@localhost:3306/
 * mysql://user:***@localhost:3306/stepik
1 rows affected.

[]

In [37]:
%%sql
INSERT genre (name_genre)
VALUES ('Роман');

   mysql://user:***@localhost:3306/
 * mysql://user:***@localhost:3306/stepik
1 rows affected.

[]

Количество полей должно совпадать:

In [34]:
%%sql
INSERT book (title, author, price, amount)
VALUES ('TEST2', 'authDr', 143.535);

%%sql
INSERT book (title, author, price)
VALUES ('TEST2', 'authDr', 143.535, 4);

   mysql://user:***@localhost:3306/
 * mysql://user:***@localhost:3306/stepik
(MySQLdb._exceptions.OperationalError) (1136, "Column count doesn't match value count at row 1")
[SQL: INSERT book (title, author, price, amount)
VALUES ('TEST2', 'authDr', 143.535);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [38]:
%%sql
SELECT * FROM book

   mysql://user:***@localhost:3306/
 * mysql://user:***@localhost:3306/stepik
4 rows affected.

[(1, 'TEST', 'authr', Decimal('143.50'), 2),
 (2, 'TEST2', 'authDr', Decimal('143.53'), 4),
 (3, 'TEST2', 'authDr', Decimal('143.54'), 4),
 (4, 'TEST2', 'authDr', Decimal('143.54'), 4)]

In [39]:
%%sql
SELECT * FROM genre

   mysql://user:***@localhost:3306/
 * mysql://user:***@localhost:3306/stepik
1 rows affected.

[(1, 'Роман')]

### Задание

In [40]:
%%sql
INSERT book (title, author, price, amount)
VALUES ('Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3);
SELECT * FROM book

   mysql://user:***@localhost:3306/
 * mysql://user:***@localhost:3306/stepik
1 rows affected.
5 rows affected.

[(1, 'TEST', 'authr', Decimal('143.50'), 2),
 (2, 'TEST2', 'authDr', Decimal('143.53'), 4),
 (3, 'TEST2', 'authDr', Decimal('143.54'), 4),
 (4, 'TEST2', 'authDr', Decimal('143.54'), 4),
 (5, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3)]